---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceServiceUtils
source: html/5b937f27-0cf5-022f-6af1-1dafdf6e9fd1.htm
---
# ExternalResourceServiceUtils Members

Gets registered external resource servers which support the external resource type.